// 介绍下 Set、Map、WeakSet 和 WeakMap 的区别？

// 详情见es6的Map_Set文件夹
// - Set
// 1. 成员为一，无序且不重复
// 2. 只有键值，没有键名，也可以说是键值与键名一致[value, value]
// 3. 可以用于数组去重
// 4. 可以遍历，方法有：add、delete、has
// 5. 很容易实现交集，并集，差集
// - WeakSet
// 1. 成员都是对象
// 2. 成员都是弱引用，可以被垃圾回收机制回收，可以用来保存DOM节点，不容易造成内存泄漏
// 3. 不能遍历，方法有add、delete、has
// - Map
// 1. 本质上是键值对的集合，类似集合,但是“键”的范围不限于字符串，各种类型的值（包括对象）都可以当作键。
// 2. 可以遍历，方法很多可以跟各种数据格式转换
// - WeakMap
// 1. 只接受对象作为键名（null除外），不接受其他类型的值作为键名
// 2. 键名是弱引用，键值可以是任意的，键名所指向的对象可以被垃圾回收，此时键名是无效的
// 3. 不能遍历，方法有get、set、has、delete
